backend/tests/load/reports/output_Search_20251216_215538.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: backend/tests/load/scenarios/search.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 4m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-12-16T22:03:48Z" level=info msg="Starting search load test" source=console
time="2025-12-16T22:03:48Z" level=info msg="Target URL: http://localhost:8080" source=console
time="2025-12-16T22:03:48Z" level=info msg="Testing 15 different queries" source=console

running (0m01.0s), 01/40 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/40 VUs  0m01.0s/4m00.0s

running (0m02.0s), 01/40 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/40 VUs  0m02.0s/4m00.0s

running (0m03.0s), 02/40 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/40 VUs  0m03.0s/4m00.0s

running (0m04.0s), 02/40 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 02/40 VUs  0m04.0s/4m00.0s

running (0m05.0s), 03/40 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 03/40 VUs  0m05.0s/4m00.0s

running (0m06.0s), 03/40 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 03/40 VUs  0m06.0s/4m00.0s

running (0m07.0s), 04/40 VUs, 6 complete and 0 interrupted iterations
default   [   3% ] 04/40 VUs  0m07.0s/4m00.0s

running (0m08.0s), 04/40 VUs, 7 complete and 0 interrupted iterations
default   [   3% ] 04/40 VUs  0m08.0s/4m00.0s

running (0m09.0s), 05/40 VUs, 9 complete and 0 interrupted iterations
default   [   4% ] 05/40 VUs  0m09.0s/4m00.0s

running (0m10.0s), 05/40 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 05/40 VUs  0m10.0s/4m00.0s

running (0m11.0s), 06/40 VUs, 12 complete and 0 interrupted iterations
default   [   5% ] 06/40 VUs  0m11.0s/4m00.0s

running (0m12.0s), 06/40 VUs, 17 complete and 0 interrupted iterations
default   [   5% ] 06/40 VUs  0m12.0s/4m00.0s

running (0m13.0s), 07/40 VUs, 18 complete and 0 interrupted iterations
default   [   5% ] 07/40 VUs  0m13.0s/4m00.0s

running (0m14.0s), 07/40 VUs, 22 complete and 0 interrupted iterations
default   [   6% ] 07/40 VUs  0m14.0s/4m00.0s

running (0m15.0s), 07/40 VUs, 25 complete and 0 interrupted iterations
default   [   6% ] 07/40 VUs  0m15.0s/4m00.0s

running (0m16.0s), 08/40 VUs, 25 complete and 0 interrupted iterations
default   [   7% ] 08/40 VUs  0m16.0s/4m00.0s

running (0m17.0s), 08/40 VUs, 31 complete and 0 interrupted iterations
default   [   7% ] 08/40 VUs  0m17.0s/4m00.0s

running (0m18.0s), 09/40 VUs, 33 complete and 0 interrupted iterations
default   [   7% ] 09/40 VUs  0m18.0s/4m00.0s

running (0m19.0s), 09/40 VUs, 37 complete and 0 interrupted iterations
default   [   8% ] 09/40 VUs  0m19.0s/4m00.0s

running (0m20.0s), 10/40 VUs, 42 complete and 0 interrupted iterations
default   [   8% ] 10/40 VUs  0m20.0s/4m00.0s

running (0m21.0s), 10/40 VUs, 43 complete and 0 interrupted iterations
default   [   9% ] 10/40 VUs  0m21.0s/4m00.0s

running (0m22.0s), 11/40 VUs, 49 complete and 0 interrupted iterations
default   [   9% ] 11/40 VUs  0m22.0s/4m00.0s

running (0m23.0s), 11/40 VUs, 54 complete and 0 interrupted iterations
default   [  10% ] 11/40 VUs  0m23.0s/4m00.0s

running (0m24.0s), 12/40 VUs, 57 complete and 0 interrupted iterations
default   [  10% ] 12/40 VUs  0m24.0s/4m00.0s

running (0m25.0s), 12/40 VUs, 61 complete and 0 interrupted iterations
default   [  10% ] 12/40 VUs  0m25.0s/4m00.0s

running (0m26.0s), 13/40 VUs, 66 complete and 0 interrupted iterations
default   [  11% ] 13/40 VUs  0m26.0s/4m00.0s

running (0m27.0s), 13/40 VUs, 72 complete and 0 interrupted iterations
default   [  11% ] 13/40 VUs  0m27.0s/4m00.0s

running (0m28.0s), 14/40 VUs, 75 complete and 0 interrupted iterations
default   [  12% ] 14/40 VUs  0m28.0s/4m00.0s

running (0m29.0s), 14/40 VUs, 80 complete and 0 interrupted iterations
default   [  12% ] 14/40 VUs  0m29.0s/4m00.0s

running (0m30.0s), 14/40 VUs, 88 complete and 0 interrupted iterations
default   [  12% ] 14/40 VUs  0m30.0s/4m00.0s

running (0m31.0s), 15/40 VUs, 91 complete and 0 interrupted iterations
default   [  13% ] 15/40 VUs  0m31.0s/4m00.0s

running (0m32.0s), 15/40 VUs, 100 complete and 0 interrupted iterations
default   [  13% ] 15/40 VUs  0m32.0s/4m00.0s

running (0m33.0s), 16/40 VUs, 106 complete and 0 interrupted iterations
default   [  14% ] 16/40 VUs  0m33.0s/4m00.0s

running (0m34.0s), 16/40 VUs, 113 complete and 0 interrupted iterations
default   [  14% ] 16/40 VUs  0m34.0s/4m00.0s

running (0m35.0s), 17/40 VUs, 117 complete and 0 interrupted iterations
default   [  15% ] 17/40 VUs  0m35.0s/4m00.0s

running (0m36.0s), 17/40 VUs, 126 complete and 0 interrupted iterations
default   [  15% ] 17/40 VUs  0m36.0s/4m00.0s

running (0m37.0s), 17/40 VUs, 131 complete and 0 interrupted iterations
default   [  15% ] 17/40 VUs  0m37.0s/4m00.0s

running (0m38.0s), 18/40 VUs, 135 complete and 0 interrupted iterations
default   [  16% ] 18/40 VUs  0m38.0s/4m00.0s

running (0m39.0s), 18/40 VUs, 142 complete and 0 interrupted iterations
default   [  16% ] 18/40 VUs  0m39.0s/4m00.0s

running (0m40.0s), 19/40 VUs, 151 complete and 0 interrupted iterations
default   [  17% ] 19/40 VUs  0m40.0s/4m00.0s

running (0m41.0s), 19/40 VUs, 157 complete and 0 interrupted iterations
default   [  17% ] 19/40 VUs  0m41.0s/4m00.0s

running (0m42.0s), 19/40 VUs, 163 complete and 0 interrupted iterations
default   [  17% ] 19/40 VUs  0m42.0s/4m00.0s

running (0m43.0s), 20/40 VUs, 170 complete and 0 interrupted iterations
default   [  18% ] 20/40 VUs  0m43.0s/4m00.0s

running (0m44.0s), 20/40 VUs, 183 complete and 0 interrupted iterations
default   [  18% ] 20/40 VUs  0m44.0s/4m00.0s

running (0m45.0s), 21/40 VUs, 192 complete and 0 interrupted iterations
default   [  19% ] 21/40 VUs  0m45.0s/4m00.0s

running (0m46.0s), 21/40 VUs, 196 complete and 0 interrupted iterations
default   [  19% ] 21/40 VUs  0m46.0s/4m00.0s

running (0m47.0s), 22/40 VUs, 204 complete and 0 interrupted iterations
default   [  20% ] 22/40 VUs  0m47.0s/4m00.0s

running (0m48.0s), 22/40 VUs, 214 complete and 0 interrupted iterations
default   [  20% ] 22/40 VUs  0m48.0s/4m00.0s

running (0m49.0s), 22/40 VUs, 222 complete and 0 interrupted iterations
default   [  20% ] 22/40 VUs  0m49.0s/4m00.0s

running (0m50.0s), 23/40 VUs, 231 complete and 0 interrupted iterations
default   [  21% ] 23/40 VUs  0m50.0s/4m00.0s

running (0m51.0s), 23/40 VUs, 239 complete and 0 interrupted iterations
default   [  21% ] 23/40 VUs  0m51.0s/4m00.0s

running (0m52.0s), 24/40 VUs, 249 complete and 0 interrupted iterations
default   [  22% ] 24/40 VUs  0m52.0s/4m00.0s

running (0m53.0s), 24/40 VUs, 262 complete and 0 interrupted iterations
default   [  22% ] 24/40 VUs  0m53.0s/4m00.0s

running (0m54.0s), 24/40 VUs, 272 complete and 0 interrupted iterations
default   [  22% ] 24/40 VUs  0m54.0s/4m00.0s

running (0m55.0s), 25/40 VUs, 284 complete and 0 interrupted iterations
default   [  23% ] 25/40 VUs  0m55.0s/4m00.0s

running (0m56.0s), 25/40 VUs, 295 complete and 0 interrupted iterations
default   [  23% ] 25/40 VUs  0m56.0s/4m00.0s

running (0m57.0s), 26/40 VUs, 303 complete and 0 interrupted iterations
default   [  24% ] 26/40 VUs  0m57.0s/4m00.0s

running (0m58.0s), 26/40 VUs, 311 complete and 0 interrupted iterations
default   [  24% ] 26/40 VUs  0m58.0s/4m00.0s

running (0m59.0s), 27/40 VUs, 323 complete and 0 interrupted iterations
default   [  25% ] 27/40 VUs  0m59.0s/4m00.0s

running (1m00.0s), 27/40 VUs, 336 complete and 0 interrupted iterations
default   [  25% ] 27/40 VUs  1m00.0s/4m00.0s

running (1m01.0s), 27/40 VUs, 348 complete and 0 interrupted iterations
default   [  25% ] 27/40 VUs  1m01.0s/4m00.0s

running (1m02.0s), 28/40 VUs, 353 complete and 0 interrupted iterations
default   [  26% ] 28/40 VUs  1m02.0s/4m00.0s

running (1m03.0s), 28/40 VUs, 367 complete and 0 interrupted iterations
default   [  26% ] 28/40 VUs  1m03.0s/4m00.0s

running (1m04.0s), 29/40 VUs, 378 complete and 0 interrupted iterations
default   [  27% ] 29/40 VUs  1m04.0s/4m00.0s

running (1m05.0s), 29/40 VUs, 392 complete and 0 interrupted iterations
default   [  27% ] 29/40 VUs  1m05.0s/4m00.0s

running (1m06.0s), 29/40 VUs, 401 complete and 0 interrupted iterations
default   [  27% ] 29/40 VUs  1m06.0s/4m00.0s

running (1m07.0s), 30/40 VUs, 414 complete and 0 interrupted iterations
default   [  28% ] 30/40 VUs  1m07.0s/4m00.0s

running (1m08.0s), 30/40 VUs, 423 complete and 0 interrupted iterations
default   [  28% ] 30/40 VUs  1m08.0s/4m00.0s

running (1m09.0s), 31/40 VUs, 436 complete and 0 interrupted iterations
default   [  29% ] 31/40 VUs  1m09.0s/4m00.0s

running (1m10.0s), 31/40 VUs, 451 complete and 0 interrupted iterations
default   [  29% ] 31/40 VUs  1m10.0s/4m00.0s

running (1m11.0s), 32/40 VUs, 463 complete and 0 interrupted iterations
default   [  30% ] 32/40 VUs  1m11.0s/4m00.0s

running (1m12.0s), 32/40 VUs, 476 complete and 0 interrupted iterations
default   [  30% ] 32/40 VUs  1m12.0s/4m00.0s

running (1m13.0s), 32/40 VUs, 490 complete and 0 interrupted iterations
default   [  30% ] 32/40 VUs  1m13.0s/4m00.0s

running (1m14.0s), 33/40 VUs, 505 complete and 0 interrupted iterations
default   [  31% ] 33/40 VUs  1m14.0s/4m00.0s

running (1m15.0s), 33/40 VUs, 516 complete and 0 interrupted iterations
default   [  31% ] 33/40 VUs  1m15.0s/4m00.0s

running (1m16.0s), 34/40 VUs, 529 complete and 0 interrupted iterations
default   [  32% ] 34/40 VUs  1m16.0s/4m00.0s

running (1m17.0s), 34/40 VUs, 539 complete and 0 interrupted iterations
default   [  32% ] 34/40 VUs  1m17.0s/4m00.0s

running (1m18.0s), 34/40 VUs, 549 complete and 0 interrupted iterations
default   [  32% ] 34/40 VUs  1m18.0s/4m00.0s

running (1m19.0s), 35/40 VUs, 564 complete and 0 interrupted iterations
default   [  33% ] 35/40 VUs  1m19.0s/4m00.0s

running (1m20.0s), 35/40 VUs, 577 complete and 0 interrupted iterations
default   [  33% ] 35/40 VUs  1m20.0s/4m00.0s

running (1m21.0s), 36/40 VUs, 594 complete and 0 interrupted iterations
default   [  34% ] 36/40 VUs  1m21.0s/4m00.0s

running (1m22.0s), 36/40 VUs, 607 complete and 0 interrupted iterations
default   [  34% ] 36/40 VUs  1m22.0s/4m00.0s

running (1m23.0s), 37/40 VUs, 624 complete and 0 interrupted iterations
default   [  35% ] 37/40 VUs  1m23.0s/4m00.0s

running (1m24.0s), 37/40 VUs, 639 complete and 0 interrupted iterations
default   [  35% ] 37/40 VUs  1m24.0s/4m00.0s

running (1m25.0s), 37/40 VUs, 654 complete and 0 interrupted iterations
default   [  35% ] 37/40 VUs  1m25.0s/4m00.0s

running (1m26.0s), 38/40 VUs, 666 complete and 0 interrupted iterations
default   [  36% ] 38/40 VUs  1m26.0s/4m00.0s

running (1m27.0s), 38/40 VUs, 683 complete and 0 interrupted iterations
default   [  36% ] 38/40 VUs  1m27.0s/4m00.0s

running (1m28.0s), 39/40 VUs, 698 complete and 0 interrupted iterations
default   [  37% ] 39/40 VUs  1m28.0s/4m00.0s

running (1m29.0s), 39/40 VUs, 713 complete and 0 interrupted iterations
default   [  37% ] 39/40 VUs  1m29.0s/4m00.0s

running (1m30.0s), 39/40 VUs, 727 complete and 0 interrupted iterations
default   [  37% ] 39/40 VUs  1m30.0s/4m00.0s

running (1m31.0s), 40/40 VUs, 738 complete and 0 interrupted iterations
default   [  38% ] 40/40 VUs  1m31.0s/4m00.0s

running (1m32.0s), 40/40 VUs, 751 complete and 0 interrupted iterations
default   [  38% ] 40/40 VUs  1m32.0s/4m00.0s

running (1m33.0s), 40/40 VUs, 773 complete and 0 interrupted iterations
default   [  39% ] 40/40 VUs  1m33.0s/4m00.0s

running (1m34.0s), 40/40 VUs, 793 complete and 0 interrupted iterations
default   [  39% ] 40/40 VUs  1m34.0s/4m00.0s

running (1m35.0s), 40/40 VUs, 806 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  1m35.0s/4m00.0s

running (1m36.0s), 40/40 VUs, 818 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  1m36.0s/4m00.0s

running (1m37.0s), 40/40 VUs, 834 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  1m37.0s/4m00.0s

running (1m38.0s), 40/40 VUs, 855 complete and 0 interrupted iterations
default   [  41% ] 40/40 VUs  1m38.0s/4m00.0s

running (1m39.0s), 40/40 VUs, 870 complete and 0 interrupted iterations
default   [  41% ] 40/40 VUs  1m39.0s/4m00.0s

running (1m40.0s), 40/40 VUs, 881 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  1m40.0s/4m00.0s

running (1m41.0s), 40/40 VUs, 903 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  1m41.0s/4m00.0s

running (1m42.0s), 40/40 VUs, 919 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  1m42.0s/4m00.0s

running (1m43.0s), 40/40 VUs, 930 complete and 0 interrupted iterations
default   [  43% ] 40/40 VUs  1m43.0s/4m00.0s

running (1m44.0s), 40/40 VUs, 946 complete and 0 interrupted iterations
default   [  43% ] 40/40 VUs  1m44.0s/4m00.0s

running (1m45.0s), 40/40 VUs, 966 complete and 0 interrupted iterations
default   [  44% ] 40/40 VUs  1m45.0s/4m00.0s

running (1m46.0s), 40/40 VUs, 981 complete and 0 interrupted iterations
default   [  44% ] 40/40 VUs  1m46.0s/4m00.0s

running (1m47.0s), 40/40 VUs, 1000 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  1m47.0s/4m00.0s

running (1m48.0s), 40/40 VUs, 1018 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  1m48.0s/4m00.0s

running (1m49.0s), 40/40 VUs, 1031 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  1m49.0s/4m00.0s

running (1m50.0s), 40/40 VUs, 1050 complete and 0 interrupted iterations
default   [  46% ] 40/40 VUs  1m50.0s/4m00.0s

running (1m51.0s), 40/40 VUs, 1064 complete and 0 interrupted iterations
default   [  46% ] 40/40 VUs  1m51.0s/4m00.0s

running (1m52.0s), 40/40 VUs, 1078 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  1m52.0s/4m00.0s

running (1m53.0s), 40/40 VUs, 1098 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  1m53.0s/4m00.0s

running (1m54.0s), 40/40 VUs, 1108 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  1m54.0s/4m00.0s

running (1m55.0s), 40/40 VUs, 1124 complete and 0 interrupted iterations
default   [  48% ] 40/40 VUs  1m55.0s/4m00.0s

running (1m56.0s), 40/40 VUs, 1142 complete and 0 interrupted iterations
default   [  48% ] 40/40 VUs  1m56.0s/4m00.0s

running (1m57.0s), 40/40 VUs, 1158 complete and 0 interrupted iterations
default   [  49% ] 40/40 VUs  1m57.0s/4m00.0s

running (1m58.0s), 40/40 VUs, 1172 complete and 0 interrupted iterations
default   [  49% ] 40/40 VUs  1m58.0s/4m00.0s

running (1m59.0s), 40/40 VUs, 1187 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  1m59.0s/4m00.0s

running (2m00.0s), 40/40 VUs, 1202 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  2m00.0s/4m00.0s

running (2m01.0s), 40/40 VUs, 1220 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  2m01.0s/4m00.0s

running (2m02.0s), 40/40 VUs, 1238 complete and 0 interrupted iterations
default   [  51% ] 40/40 VUs  2m02.0s/4m00.0s

running (2m03.0s), 40/40 VUs, 1255 complete and 0 interrupted iterations
default   [  51% ] 40/40 VUs  2m03.0s/4m00.0s

running (2m04.0s), 40/40 VUs, 1269 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  2m04.0s/4m00.0s

running (2m05.0s), 40/40 VUs, 1283 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  2m05.0s/4m00.0s

running (2m06.0s), 40/40 VUs, 1301 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  2m06.0s/4m00.0s

running (2m07.0s), 40/40 VUs, 1320 complete and 0 interrupted iterations
default   [  53% ] 40/40 VUs  2m07.0s/4m00.0s

running (2m08.0s), 40/40 VUs, 1330 complete and 0 interrupted iterations
default   [  53% ] 40/40 VUs  2m08.0s/4m00.0s

running (2m09.0s), 40/40 VUs, 1351 complete and 0 interrupted iterations
default   [  54% ] 40/40 VUs  2m09.0s/4m00.0s

running (2m10.0s), 40/40 VUs, 1368 complete and 0 interrupted iterations
default   [  54% ] 40/40 VUs  2m10.0s/4m00.0s

running (2m11.0s), 40/40 VUs, 1387 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  2m11.0s/4m00.0s

running (2m12.0s), 40/40 VUs, 1398 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  2m12.0s/4m00.0s

running (2m13.0s), 40/40 VUs, 1414 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  2m13.0s/4m00.0s

running (2m14.0s), 40/40 VUs, 1434 complete and 0 interrupted iterations
default   [  56% ] 40/40 VUs  2m14.0s/4m00.0s

running (2m15.0s), 40/40 VUs, 1446 complete and 0 interrupted iterations
default   [  56% ] 40/40 VUs  2m15.0s/4m00.0s

running (2m16.0s), 40/40 VUs, 1461 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  2m16.0s/4m00.0s

running (2m17.0s), 40/40 VUs, 1477 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  2m17.0s/4m00.0s

running (2m18.0s), 40/40 VUs, 1495 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  2m18.0s/4m00.0s

running (2m19.0s), 40/40 VUs, 1511 complete and 0 interrupted iterations
default   [  58% ] 40/40 VUs  2m19.0s/4m00.0s

running (2m20.0s), 40/40 VUs, 1529 complete and 0 interrupted iterations
default   [  58% ] 40/40 VUs  2m20.0s/4m00.0s

running (2m21.0s), 40/40 VUs, 1545 complete and 0 interrupted iterations
default   [  59% ] 40/40 VUs  2m21.0s/4m00.0s

running (2m22.0s), 40/40 VUs, 1560 complete and 0 interrupted iterations
default   [  59% ] 40/40 VUs  2m22.0s/4m00.0s

running (2m23.0s), 40/40 VUs, 1581 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  2m23.0s/4m00.0s

running (2m24.0s), 40/40 VUs, 1594 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  2m24.0s/4m00.0s

running (2m25.0s), 40/40 VUs, 1614 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  2m25.0s/4m00.0s

running (2m26.0s), 40/40 VUs, 1632 complete and 0 interrupted iterations
default   [  61% ] 40/40 VUs  2m26.0s/4m00.0s

running (2m27.0s), 40/40 VUs, 1650 complete and 0 interrupted iterations
default   [  61% ] 40/40 VUs  2m27.0s/4m00.0s

running (2m28.0s), 40/40 VUs, 1663 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  2m28.0s/4m00.0s

running (2m29.0s), 40/40 VUs, 1677 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  2m29.0s/4m00.0s

running (2m30.0s), 40/40 VUs, 1694 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  2m30.0s/4m00.0s

running (2m31.0s), 40/40 VUs, 1708 complete and 0 interrupted iterations
default   [  63% ] 40/40 VUs  2m31.0s/4m00.0s

running (2m32.0s), 40/40 VUs, 1725 complete and 0 interrupted iterations
default   [  63% ] 40/40 VUs  2m32.0s/4m00.0s

running (2m33.0s), 40/40 VUs, 1743 complete and 0 interrupted iterations
default   [  64% ] 40/40 VUs  2m33.0s/4m00.0s

running (2m34.0s), 40/40 VUs, 1757 complete and 0 interrupted iterations
default   [  64% ] 40/40 VUs  2m34.0s/4m00.0s

running (2m35.0s), 40/40 VUs, 1771 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  2m35.0s/4m00.0s

running (2m36.0s), 40/40 VUs, 1785 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  2m36.0s/4m00.0s

running (2m37.0s), 40/40 VUs, 1806 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  2m37.0s/4m00.0s

running (2m38.0s), 40/40 VUs, 1827 complete and 0 interrupted iterations
default   [  66% ] 40/40 VUs  2m38.0s/4m00.0s

running (2m39.0s), 40/40 VUs, 1838 complete and 0 interrupted iterations
default   [  66% ] 40/40 VUs  2m39.0s/4m00.0s

running (2m40.0s), 40/40 VUs, 1854 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  2m40.0s/4m00.0s

running (2m41.0s), 40/40 VUs, 1872 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  2m41.0s/4m00.0s

running (2m42.0s), 40/40 VUs, 1887 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  2m42.0s/4m00.0s

running (2m43.0s), 40/40 VUs, 1905 complete and 0 interrupted iterations
default   [  68% ] 40/40 VUs  2m43.0s/4m00.0s

running (2m44.0s), 40/40 VUs, 1923 complete and 0 interrupted iterations
default   [  68% ] 40/40 VUs  2m44.0s/4m00.0s

running (2m45.0s), 40/40 VUs, 1932 complete and 0 interrupted iterations
default   [  69% ] 40/40 VUs  2m45.0s/4m00.0s

running (2m46.0s), 40/40 VUs, 1953 complete and 0 interrupted iterations
default   [  69% ] 40/40 VUs  2m46.0s/4m00.0s

running (2m47.0s), 40/40 VUs, 1965 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  2m47.0s/4m00.0s

running (2m48.0s), 40/40 VUs, 1985 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  2m48.0s/4m00.0s

running (2m49.0s), 40/40 VUs, 1996 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  2m49.0s/4m00.0s

running (2m50.0s), 40/40 VUs, 2014 complete and 0 interrupted iterations
default   [  71% ] 40/40 VUs  2m50.0s/4m00.0s

running (2m51.0s), 40/40 VUs, 2026 complete and 0 interrupted iterations
default   [  71% ] 40/40 VUs  2m51.0s/4m00.0s

running (2m52.0s), 40/40 VUs, 2046 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  2m52.0s/4m00.0s

running (2m53.0s), 40/40 VUs, 2062 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  2m53.0s/4m00.0s

running (2m54.0s), 40/40 VUs, 2078 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  2m54.0s/4m00.0s

running (2m55.0s), 40/40 VUs, 2095 complete and 0 interrupted iterations
default   [  73% ] 40/40 VUs  2m55.0s/4m00.0s

running (2m56.0s), 40/40 VUs, 2108 complete and 0 interrupted iterations
default   [  73% ] 40/40 VUs  2m56.0s/4m00.0s

running (2m57.0s), 40/40 VUs, 2124 complete and 0 interrupted iterations
default   [  74% ] 40/40 VUs  2m57.0s/4m00.0s

running (2m58.0s), 40/40 VUs, 2143 complete and 0 interrupted iterations
default   [  74% ] 40/40 VUs  2m58.0s/4m00.0s

running (2m59.0s), 40/40 VUs, 2156 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  2m59.0s/4m00.0s

running (3m00.0s), 40/40 VUs, 2175 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  3m00.0s/4m00.0s

running (3m01.0s), 40/40 VUs, 2191 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  3m01.0s/4m00.0s

running (3m02.0s), 40/40 VUs, 2203 complete and 0 interrupted iterations
default   [  76% ] 40/40 VUs  3m02.0s/4m00.0s

running (3m03.0s), 40/40 VUs, 2222 complete and 0 interrupted iterations
default   [  76% ] 40/40 VUs  3m03.0s/4m00.0s

running (3m04.0s), 40/40 VUs, 2236 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  3m04.0s/4m00.0s

running (3m05.0s), 40/40 VUs, 2257 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  3m05.0s/4m00.0s

running (3m06.0s), 40/40 VUs, 2268 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  3m06.0s/4m00.0s

running (3m07.0s), 40/40 VUs, 2283 complete and 0 interrupted iterations
default   [  78% ] 40/40 VUs  3m07.0s/4m00.0s

running (3m08.0s), 40/40 VUs, 2301 complete and 0 interrupted iterations
default   [  78% ] 40/40 VUs  3m08.0s/4m00.0s

running (3m09.0s), 40/40 VUs, 2314 complete and 0 interrupted iterations
default   [  79% ] 40/40 VUs  3m09.0s/4m00.0s

running (3m10.0s), 40/40 VUs, 2331 complete and 0 interrupted iterations
default   [  79% ] 40/40 VUs  3m10.0s/4m00.0s

running (3m11.0s), 40/40 VUs, 2350 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  3m11.0s/4m00.0s

running (3m12.0s), 40/40 VUs, 2364 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  3m12.0s/4m00.0s

running (3m13.0s), 40/40 VUs, 2376 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  3m13.0s/4m00.0s

running (3m14.0s), 40/40 VUs, 2394 complete and 0 interrupted iterations
default   [  81% ] 40/40 VUs  3m14.0s/4m00.0s

running (3m15.0s), 40/40 VUs, 2409 complete and 0 interrupted iterations
default   [  81% ] 40/40 VUs  3m15.0s/4m00.0s

running (3m16.0s), 40/40 VUs, 2432 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  3m16.0s/4m00.0s

running (3m17.0s), 40/40 VUs, 2443 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  3m17.0s/4m00.0s

running (3m18.0s), 40/40 VUs, 2461 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  3m18.0s/4m00.0s

running (3m19.0s), 40/40 VUs, 2480 complete and 0 interrupted iterations
default   [  83% ] 40/40 VUs  3m19.0s/4m00.0s

running (3m20.0s), 40/40 VUs, 2493 complete and 0 interrupted iterations
default   [  83% ] 40/40 VUs  3m20.0s/4m00.0s

running (3m21.0s), 40/40 VUs, 2509 complete and 0 interrupted iterations
default   [  84% ] 40/40 VUs  3m21.0s/4m00.0s

running (3m22.0s), 40/40 VUs, 2522 complete and 0 interrupted iterations
default   [  84% ] 40/40 VUs  3m22.0s/4m00.0s

running (3m23.0s), 40/40 VUs, 2541 complete and 0 interrupted iterations
default   [  85% ] 40/40 VUs  3m23.0s/4m00.0s

running (3m24.0s), 40/40 VUs, 2559 complete and 0 interrupted iterations
default   [  85% ] 40/40 VUs  3m24.0s/4m00.0s

running (3m25.0s), 40/40 VUs, 2569 complete and 0 interrupted iterations
default   [  85% ] 40/40 VUs  3m25.0s/4m00.0s

running (3m26.0s), 40/40 VUs, 2587 complete and 0 interrupted iterations
default   [  86% ] 40/40 VUs  3m26.0s/4m00.0s

running (3m27.0s), 40/40 VUs, 2597 complete and 0 interrupted iterations
default   [  86% ] 40/40 VUs  3m27.0s/4m00.0s

running (3m28.0s), 40/40 VUs, 2616 complete and 0 interrupted iterations
default   [  87% ] 40/40 VUs  3m28.0s/4m00.0s

running (3m29.0s), 40/40 VUs, 2637 complete and 0 interrupted iterations
default   [  87% ] 40/40 VUs  3m29.0s/4m00.0s

running (3m30.0s), 40/40 VUs, 2647 complete and 0 interrupted iterations
default   [  87% ] 40/40 VUs  3m30.0s/4m00.0s

running (3m31.0s), 40/40 VUs, 2664 complete and 0 interrupted iterations
default   [  88% ] 40/40 VUs  3m31.0s/4m00.0s

running (3m32.0s), 40/40 VUs, 2678 complete and 0 interrupted iterations
default   [  88% ] 40/40 VUs  3m32.0s/4m00.0s

running (3m33.0s), 38/40 VUs, 2697 complete and 0 interrupted iterations
default   [  89% ] 38/40 VUs  3m33.0s/4m00.0s

running (3m34.0s), 37/40 VUs, 2707 complete and 0 interrupted iterations
default   [  89% ] 37/40 VUs  3m34.0s/4m00.0s

running (3m35.0s), 35/40 VUs, 2724 complete and 0 interrupted iterations
default   [  90% ] 35/40 VUs  3m35.0s/4m00.0s

running (3m36.0s), 34/40 VUs, 2741 complete and 0 interrupted iterations
default   [  90% ] 34/40 VUs  3m36.0s/4m00.0s

running (3m37.0s), 34/40 VUs, 2752 complete and 0 interrupted iterations
default   [  90% ] 34/40 VUs  3m37.0s/4m00.0s

running (3m38.0s), 33/40 VUs, 2764 complete and 0 interrupted iterations
default   [  91% ] 33/40 VUs  3m38.0s/4m00.0s

running (3m39.0s), 30/40 VUs, 2784 complete and 0 interrupted iterations
default   [  91% ] 30/40 VUs  3m39.0s/4m00.0s

running (3m40.0s), 29/40 VUs, 2798 complete and 0 interrupted iterations
default   [  92% ] 29/40 VUs  3m40.0s/4m00.0s

running (3m41.0s), 29/40 VUs, 2804 complete and 0 interrupted iterations
default   [  92% ] 29/40 VUs  3m41.0s/4m00.0s

running (3m42.0s), 28/40 VUs, 2819 complete and 0 interrupted iterations
default   [  92% ] 28/40 VUs  3m42.0s/4m00.0s

running (3m43.0s), 26/40 VUs, 2832 complete and 0 interrupted iterations
default   [  93% ] 26/40 VUs  3m43.0s/4m00.0s

running (3m44.0s), 25/40 VUs, 2842 complete and 0 interrupted iterations
default   [  93% ] 25/40 VUs  3m44.0s/4m00.0s

running (3m45.0s), 21/40 VUs, 2853 complete and 0 interrupted iterations
default   [  94% ] 21/40 VUs  3m45.0s/4m00.0s

running (3m46.0s), 20/40 VUs, 2864 complete and 0 interrupted iterations
default   [  94% ] 20/40 VUs  3m46.0s/4m00.0s

running (3m47.0s), 20/40 VUs, 2869 complete and 0 interrupted iterations
default   [  95% ] 20/40 VUs  3m47.0s/4m00.0s

running (3m48.0s), 19/40 VUs, 2877 complete and 0 interrupted iterations
default   [  95% ] 19/40 VUs  3m48.0s/4m00.0s

running (3m49.0s), 16/40 VUs, 2890 complete and 0 interrupted iterations
default   [  95% ] 16/40 VUs  3m49.0s/4m00.0s

running (3m50.0s), 15/40 VUs, 2894 complete and 0 interrupted iterations
default   [  96% ] 15/40 VUs  3m50.0s/4m00.0s

running (3m51.0s), 14/40 VUs, 2901 complete and 0 interrupted iterations
default   [  96% ] 14/40 VUs  3m51.0s/4m00.0s

running (3m52.0s), 13/40 VUs, 2908 complete and 0 interrupted iterations
default   [  97% ] 13/40 VUs  3m52.0s/4m00.0s

running (3m53.0s), 11/40 VUs, 2911 complete and 0 interrupted iterations
default   [  97% ] 11/40 VUs  3m53.0s/4m00.0s

running (3m54.0s), 11/40 VUs, 2918 complete and 0 interrupted iterations
default   [  97% ] 11/40 VUs  3m54.0s/4m00.0s

running (3m55.0s), 10/40 VUs, 2921 complete and 0 interrupted iterations
default   [  98% ] 10/40 VUs  3m55.0s/4m00.0s

running (3m56.0s), 08/40 VUs, 2924 complete and 0 interrupted iterations
default   [  98% ] 08/40 VUs  3m56.0s/4m00.0s

running (3m57.0s), 06/40 VUs, 2929 complete and 0 interrupted iterations
default   [  99% ] 06/40 VUs  3m57.0s/4m00.0s

running (3m58.0s), 06/40 VUs, 2931 complete and 0 interrupted iterations
default   [  99% ] 06/40 VUs  3m58.0s/4m00.0s

running (3m59.0s), 06/40 VUs, 2931 complete and 0 interrupted iterations
default   [ 100% ] 06/40 VUs  3m59.0s/4m00.0s

running (4m00.0s), 03/40 VUs, 2935 complete and 0 interrupted iterations
default   [ 100% ] 03/40 VUs  4m00.0s/4m00.0s

running (4m01.0s), 01/40 VUs, 2937 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/40 VUs  4m0s

running (4m02.0s), 01/40 VUs, 2937 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/40 VUs  4m0s
time="2025-12-16T22:07:51Z" level=info msg="Search load test completed" source=console


  █ THRESHOLDS 

    errors
    ✗ 'rate<0.02' rate=100.00%

    http_req_duration{endpoint:search}
    ✓ 'p(95)<100' p(95)=703.45µs
    ✓ 'p(99)<200' p(99)=802.32µs

    http_req_duration{endpoint:suggestions}
    ✓ 'p(95)<50' p(95)=720.69µs
    ✓ 'p(99)<100' p(99)=835.32µs

    http_req_failed
    ✗ 'rate<0.02' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 11754  48.382441/s
    checks_succeeded...: 37.50% 4408 out of 11754
    checks_failed......: 62.49% 7346 out of 11754

    ✗ game search status is 200
      ↳  0% — ✓ 0 / ✗ 416
    ✓ game search response time < 100ms
    ✗ has results
      ↳  0% — ✓ 0 / ✗ 2648
    ✗ tag search status is 200
      ↳  0% — ✓ 0 / ✗ 762
    ✓ tag search response time < 100ms
    ✗ search status is 200
      ↳  0% — ✓ 0 / ✗ 1470
    ✓ search response time < 100ms
    ✓ search response time < 50ms
    ✗ has pagination
      ↳  0% — ✓ 0 / ✗ 1470
    ✗ suggestions status is 200
      ↳  0% — ✓ 0 / ✗ 290
    ✓ suggestions response time < 50ms
    ✗ has suggestions
      ↳  0% — ✓ 0 / ✗ 290

    CUSTOM
    errors.......................: 100.00% 2938 out of 2938
    search_load_time.............: avg=0.531312 min=0.366884 med=0.499214 max=3.870496 p(90)=0.665366 p(95)=0.703452
    suggestions_load_time........: avg=0.532429 min=0.349141 med=0.48507  max=3.533282 p(90)=0.67763  p(95)=0.720694
    total_requests...............: 2938    12.093552/s

    HTTP
    http_req_duration............: avg=531.42µs min=349.14µs med=498.36µs max=3.87ms   p(90)=665.99µs p(95)=705.21µs
      { endpoint:search }........: avg=531.31µs min=366.88µs med=499.21µs max=3.87ms   p(90)=665.36µs p(95)=703.45µs
      { endpoint:suggestions }...: avg=532.42µs min=349.14µs med=485.07µs max=3.53ms   p(90)=677.63µs p(95)=720.69µs
    http_req_failed..............: 100.00% 2938 out of 2938
    http_reqs....................: 2938    12.093552/s

    EXECUTION
    iteration_duration...........: avg=2.49s    min=1s       med=2.47s    max=3.99s    p(90)=3.68s    p(95)=3.83s   
    iterations...................: 2938    12.093552/s
    vus..........................: 1       min=1            max=40
    vus_max......................: 40      min=40           max=40

    NETWORK
    data_received................: 3.3 MB  14 kB/s
    data_sent....................: 405 kB  1.7 kB/s



running (4m02.9s), 00/40 VUs, 2938 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  4m0s
time="2025-12-16T22:07:51Z" level=error msg="thresholds on metrics 'errors, http_req_failed' have been crossed"